practice-for-ch-rails-music-app-long-practice-main/MusicApp/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def current_user
        User.find_by(session_token: session[:session_token])